{
  "{\"destination\":\"indore\",\"duration\":2,\"budget\":10000,\"persons\":2,\"objective\":\"enjoy\",\"foodType\":\"veg\"}": {
    "data": {
      "destination": "Indore",
      "duration": 2,
      "itinerary": [
        {
          "day": 1,
          "title": "Historical Marvels & Street Food Delights",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Indore pahunch kar hotel mein check-in karein aur thoda aaram karein. (Arrive in Indore, check into your budget-friendly hotel, and relax a bit.)",
              "location": "Hotel (e.g., near Railway Station or Vijay Nagar area)"
            },
            {
              "time": "10:00 AM",
              "activity": "Breakfast ke liye Indori Poha aur Jalebi ka swaad lein. (Savor Indori Poha and Jalebi for breakfast, a must-try local specialty.)",
              "location": "Local eatery near hotel or a famous spot like Apna Sweets"
            },
            {
              "time": "11:00 AM",
              "activity": "Indore ke shandaar Rajwada Palace ki sair karein, jo Holkar vansh ki virasat darshata hai. (Explore the magnificent Rajwada Palace, showcasing the heritage of the Holkar dynasty.)",
              "location": "Rajwada Palace"
            },
            {
              "time": "12:30 PM",
              "activity": "Kanch Mandir (Glass Temple) ki adbhut kala aur shanti ka anubhav karein. (Experience the exquisite artistry and serenity of Kanch Mandir (Glass Temple), adorned with thousands of mirrors.)",
              "location": "Kanch Mandir"
            },
            {
              "time": "01:30 PM",
              "activity": "Lunch ke liye ek sthaniya restaurant mein swadisht Dal Bafla ya veg thali ka anand lein. (Enjoy a delicious Dal Bafla or a wholesome veg thali for lunch at a local restaurant.)",
              "location": "Local Restaurant (e.g., Shree Guru Kripa, Rajhans Restaurant)"
            },
            {
              "time": "03:30 PM",
              "activity": "Lal Bagh Palace ki shahi shaan aur uske khoobsurat bagichon ko dekhein. (Visit the regal grandeur of Lal Bagh Palace and its beautiful gardens, reflecting European architecture.)",
              "location": "Lal Bagh Palace"
            },
            {
              "time": "06:30 PM",
              "activity": "Shaam ko prasiddh Sarafa Bazaar mein ghoomein aur wahan ke anokhe street food ka swaad lein. Yeh bazaar raat mein food hub ban jaata hai. (In the evening, stroll through the famous Sarafa Bazaar and indulge in its unique street food. This market transforms into a vibrant food hub at night.)",
              "location": "Sarafa Bazaar"
            }
          ]
        },
        {
          "day": 2,
          "title": "Spiritual Serenity & Culinary Hotspots",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Hotel mein breakfast karein ya phir kisi local cafe mein Indori nashta try karein. (Have breakfast at the hotel or try Indori breakfast at a local cafe.)",
              "location": "Hotel or Local Cafe"
            },
            {
              "time": "10:00 AM",
              "activity": "Khajrana Ganesh Temple ke darshan karein, jo Indore ka ek bahut hi pavitra sthal hai aur yahan ki murti bahut prasiddh hai. (Visit the Khajrana Ganesh Temple, a very sacred site in Indore, famous for its idol.)",
              "location": "Khajrana Ganesh Temple"
            },
            {
              "time": "11:30 AM",
              "activity": "Annapurna Temple ki shanti ka anubhav karein, jo Devi Annapurna ko samarpit hai. (Experience the tranquility of Annapurna Temple, dedicated to Goddess Annapurna.)",
              "location": "Annapurna Temple"
            },
            {
              "time": "01:00 PM",
              "activity": "Lunch ke liye ek achhe veg restaurant mein bhojan karein. (Have lunch at a good vegetarian restaurant, trying local specialties or a full meal.)",
              "location": "Local Restaurant (e.g., Shreemaya Celebrity, Nafees Bakery & Restaurant for veg options)"
            },
            {
              "time": "02:30 PM",
              "activity": "Chappan Dukan par alag-alag tarah ke snacks, sweets aur shakes ka anand lein. Yeh ek aur prasiddh food street hai. (Enjoy various snacks, sweets, and shakes at Chappan Dukan. This is another famous food street.)",
              "location": "Chappan Dukan"
            },
            {
              "time": "04:00 PM",
              "activity": "Thodi shopping karein ya Central Museum mein Indore ke itihaas aur kala ko samjhein. (Do some souvenir shopping at local markets or explore Indore's history and art at the Central Museum.)",
              "location": "Central Museum / Local Market (e.g., MT Cloth Market for textiles, or general souvenir shops)"
            },
            {
              "time": "06:00 PM",
              "activity": "Shaam ki chai/coffee aur halka nashta karein, phir Indore se prasthan ke liye taiyari karein. (Have evening tea/coffee and light snacks, then prepare for departure from Indore.)",
              "location": "Cafe or Departure Point"
            }
          ]
        }
      ],
      "foodItinerary": [
        {
          "meal": "Breakfast",
          "recommendation": "Indori Poha-Jalebi (a must-try), Samosa, Kachori, Garam Doodh (hot milk) at local eateries or famous spots like Apna Sweets, Om Prakash Parathe Wale."
        },
        {
          "meal": "Lunch",
          "recommendation": "Dal Bafla/Baati (traditional Malwa dish), Veg Thali, Sabudana Khichdi, Pulao at restaurants like Shree Guru Kripa, Shreemaya Celebrity, or local dhabas."
        },
        {
          "meal": "Dinner",
          "recommendation": "Sarafa Bazaar street food (Bhutta ka Kees, Garadu, Dahi Vada, Pani Puri, Kulfi, Malpua, Sabudana Vada), or a full meal at a restaurant if you prefer a sit-down dinner."
        },
        {
          "meal": "Snacks",
          "recommendation": "Chappan Dukan (Hot Dog (veg), Patties, Shakes, Sweets, Vijay Chat House), Indori Namkeen (various types of sev and mixtures), Gajak (seasonal sweet)."
        }
      ],
      "famousPlaces": [
        "Rajwada Palace",
        "Kanch Mandir",
        "Lal Bagh Palace",
        "Sarafa Bazaar",
        "Chappan Dukan",
        "Khajrana Ganesh Temple",
        "Annapurna Temple",
        "Central Museum",
        "Krishnapura Chhatris"
      ],
      "dosAndDonts": {
        "dos": [
          "Indore ke prasiddh street food ka swaad zaroor lein, khaaskar Poha-Jalebi aur Sarafa Bazaar ki dishes. (Do try Indore's famous street food, especially Poha-Jalebi and Sarafa Bazaar dishes.)",
          "Local markets mein kharidari karte samay mol-bhav karein, khaaskar chhote dukaanon par. (Do bargain while shopping in local markets, especially at smaller shops.)",
          "Paryapt paani piyein aur garmi se bachein, khaaskar garmiyon mein. (Do drink plenty of water and stay hydrated, especially in summers.)",
          "Dharmik sthalon par maryada aur shanti banaye rakhein aur uchit vastra pehnein. (Do maintain decorum and peace at religious sites and wear appropriate attire.)",
          "Local transport ke liye auto-rickshaw ya ride-sharing apps (Ola/Uber) ka upyog karein, yeh suvidhajanak aur budget-friendly hain. (Do use auto-rickshaws or ride-sharing apps (Ola/Uber) for local transport, they are convenient and budget-friendly.)",
          "Apne budget ka dhyan rakhein aur kharchon ko track karein taaki aap ₹10000 ke andar reh sakein. (Do keep track of your budget and expenses to stay within ₹10000.)"
        ],
        "donts": [
          "Sadkon par kooda na phenkein aur swachhta banaye rakhein. (Don't litter on the streets and maintain cleanliness.)",
          "Dharmik sthalon par tasveerein lete samay flash ka upyog na karein, agar mana ho. (Don't use flash photography at religious places if prohibited.)",
          "Der raat Sarafa Bazaar mein zyada bheed hone par apne samaan ka dhyan rakhein. (Don't be careless with your belongings in Sarafa Bazaar late at night due to crowds.)",
          "Anjaan logon se zyada ghulne-milne se bachein aur apni suraksha ka dhyan rakhein. (Don't get overly friendly with strangers and prioritize your safety.)",
          "Traffic niyam na todein, khaaskar paidal chalte samay aur sadak paar karte samay savdhani bartein. (Don't break traffic rules, especially while walking and crossing roads.)",
          "Aisi jagahon par na jayein jo surakshit na hon ya jahan jaane ki salah na di gayi ho. (Don't visit places that are unsafe or not recommended.)"
        ]
      }
    },
    "timestamp": 1763577034811
  },
  "{\"destination\":\"goa\",\"duration\":7,\"budget\":40000,\"persons\":1,\"objective\":\"relaxation\",\"foodType\":\"veg\"}": {
    "data": {
      "destination": "Goa",
      "duration": 7,
      "itinerary": [
        {
          "day": 1,
          "title": "Arrival & North Goa Beach Bliss",
          "activities": [
            {
              "time": "12:00 PM",
              "activity": "Dabolim Airport (GOI) से आगमन, प्री-बुक किए गए टैक्सी/कैब से होटल/गेस्टहाउस (उत्तरी गोवा में) चेक-इन करें।",
              "location": "उत्तरी गोवा (जैसे अंजुना, वागेटर, आरपोरा)"
            },
            {
              "time": "02:00 PM",
              "activity": "होटल में आराम करें और फ्रेश हों।",
              "location": "होटल/गेस्टहाउस"
            },
            {
              "time": "03:00 PM",
              "activity": "आस-पास के किसी कैफे में हल्का शाकाहारी लंच करें।",
              "location": "स्थानीय कैफे"
            },
            {
              "time": "04:30 PM",
              "activity": "अंजुना बीच पर टहलें, समुद्र किनारे आराम करें और सूर्यास्त का आनंद लें।",
              "location": "अंजुना बीच"
            },
            {
              "time": "07:30 PM",
              "activity": "समुद्र किनारे किसी शांत शाकाहारी रेस्टोरेंट में डिनर करें।",
              "location": "अंजुना बीच शैक/रेस्टोरेंट"
            },
            {
              "time": "09:00 PM",
              "activity": "होटल वापस आएं और आराम करें।",
              "location": "होटल/गेस्टहाउस"
            }
          ]
        },
        {
          "day": 2,
          "title": "Yoga, Serene Beaches & Sunset Cruise",
          "activities": [
            {
              "time": "07:00 AM",
              "activity": "सुबह की योग क्लास में भाग लें (कई गेस्टहाउस या बीच शैक योग सेशन ऑफर करते हैं)।",
              "location": "स्थानीय योग सेंटर/बीच शैक"
            },
            {
              "time": "08:30 AM",
              "activity": "होटल में या पास के कैफे में शाकाहारी नाश्ता करें।",
              "location": "होटल/स्थानीय कैफे"
            },
            {
              "time": "10:00 AM",
              "activity": "मोरजिम बीच (टर्टल बीच) की ओर जाएं, जो अपनी शांति और कछुओं के घोंसले के लिए जाना जाता है।",
              "location": "मोरजिम बीच"
            },
            {
              "time": "01:00 PM",
              "activity": "मोरजिम में किसी बीच शैक पर शाकाहारी लंच करें।",
              "location": "मोरजिम बीच शैक"
            },
            {
              "time": "03:00 PM",
              "activity": "आराम करें, किताब पढ़ें या समुद्र में तैरें।",
              "location": "मोरजिम बीच"
            },
            {
              "time": "05:00 PM",
              "activity": "मंडोवी नदी पर सूर्यास्त क्रूज का अनुभव करें (वैकल्पिक, अतिरिक्त लागत)।",
              "location": "मंडोवी नदी, पणजी"
            },
            {
              "time": "08:00 PM",
              "activity": "उत्तरी गोवा वापस आकर किसी अच्छे शाकाहारी रेस्टोरेंट में डिनर करें।",
              "location": "उत्तरी गोवा रेस्टोरेंट"
            }
          ]
        },
        {
          "day": 3,
          "title": "Fort Views & Arambol's Bohemian Charm",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "होटल में शाकाहारी नाश्ता करें।",
              "location": "होटल/गेस्टहाउस"
            },
            {
              "time": "10:30 AM",
              "activity": "चपोरा फोर्ट जाएं और वागेटर बीच और आसपास के शानदार नज़ारों का आनंद लें।",
              "location": "चपोरा फोर्ट"
            },
            {
              "time": "12:30 PM",
              "activity": "अरामबोल बीच की ओर बढ़ें, जो अपने बोहेमियन माहौल के लिए प्रसिद्ध है।",
              "location": "अरामबोल बीच"
            },
            {
              "time": "01:30 PM",
              "activity": "अरामबोल में किसी कैफे में शाकाहारी लंच करें।",
              "location": "अरामबोल कैफे"
            },
            {
              "time": "03:00 PM",
              "activity": "अरामबोल स्वीट वाटर लेक और पास के जंगल में टहलें।",
              "location": "अरामबोल स्वीट वाटर लेक"
            },
            {
              "time": "05:30 PM",
              "activity": "अरामबोल बीच पर सूर्यास्त देखें और ड्रम सर्कल (यदि उपलब्ध हो) का अनुभव करें।",
              "location": "अरामबोल बीच"
            },
            {
              "time": "08:00 PM",
              "activity": "उत्तरी गोवा वापस आकर डिनर करें।",
              "location": "उत्तरी गोवा रेस्टोरेंट"
            }
          ]
        },
        {
          "day": 4,
          "title": "Old Goa Heritage & Spice Plantation Tour",
          "activities": [
            {
              "time": "08:30 AM",
              "activity": "होटल में शाकाहारी नाश्ता करें।",
              "location": "होटल/गेस्टहाउस"
            },
            {
              "time": "09:30 AM",
              "activity": "ओल्ड गोवा के लिए टैक्सी/स्कूटर से यात्रा करें।",
              "location": "ओल्ड गोवा"
            },
            {
              "time": "10:30 AM",
              "activity": "बेसिलिका ऑफ बॉम जीसस और से कैथेड्रल जैसे ऐतिहासिक चर्चों और स्मारकों का भ्रमण करें।",
              "location": "बेसिलिका ऑफ बॉम जीसस, से कैथेड्रल"
            },
            {
              "time": "01:00 PM",
              "activity": "एक मसाला बागान (Spice Plantation) का दौरा करें, जहां आप मसालों के बारे में जान सकते हैं और पारंपरिक शाकाहारी गोअन लंच का आनंद ले सकते हैं।",
              "location": "सहकारी स्पाइस प्लांटेशन/सहेकरी स्पाइस फार्म"
            },
            {
              "time": "04:00 PM",
              "activity": "उत्तरी गोवा वापस आएं और आराम करें।",
              "location": "होटल/गेस्टहाउस"
            },
            {
              "time": "07:30 PM",
              "activity": "किसी शांत कैफे में डिनर करें या होटल में आराम करें।",
              "location": "उत्तरी गोवा कैफे"
            }
          ]
        },
        {
          "day": 5,
          "title": "South Goa's Pristine Beaches (Day Trip)",
          "activities": [
            {
              "time": "07:00 AM",
              "activity": "जल्दी नाश्ता करें और दक्षिण गोवा के लिए टैक्सी किराए पर लें (पूरे दिन के लिए)।",
              "location": "होटल/गेस्टहाउस"
            },
            {
              "time": "09:30 AM",
              "activity": "पालोलेम बीच पहुंचें, जो अपने अर्धचंद्राकार आकार और शांत पानी के लिए प्रसिद्ध है।",
              "location": "पालोलेम बीच"
            },
            {
              "time": "10:00 AM",
              "activity": "समुद्र में तैरें, धूप सेंकें या कयाकिंग का आनंद लें (वैकल्पिक)।",
              "location": "पालोलेम बीच"
            },
            {
              "time": "01:00 PM",
              "activity": "पालोलेम में किसी बीच शैक पर शाकाहारी लंच करें।",
              "location": "पालोलेम बीच शैक"
            },
            {
              "time": "02:30 PM",
              "activity": "अगोन्डा बीच की ओर बढ़ें, जो पालोलेम से भी अधिक शांत और कम भीड़भाड़ वाला है।",
              "location": "अगोन्डा बीच"
            },
            {
              "time": "04:30 PM",
              "activity": "अगोन्डा में सूर्यास्त का आनंद लें।",
              "location": "अगोन्डा बीच"
            },
            {
              "time": "06:00 PM",
              "activity": "उत्तरी गोवा के लिए वापसी की यात्रा शुरू करें।",
              "location": "अगोन्डा बीच"
            },
            {
              "time": "09:00 PM",
              "activity": "होटल वापस आकर हल्का डिनर करें।",
              "location": "होटल/गेस्टहाउस"
            }
          ]
        },
        {
          "day": 6,
          "title": "Wellness & Local Market Exploration",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "होटल में शाकाहारी नाश्ता करें।",
              "location": "होटल/गेस्टहाउस"
            },
            {
              "time": "10:30 AM",
              "activity": "एक आयुर्वेदिक मसाज या स्पा सेशन बुक करें (पहले से बुकिंग की सलाह दी जाती है)।",
              "location": "स्थानीय स्पा/वेलनेस सेंटर"
            },
            {
              "time": "01:00 PM",
              "activity": "स्थानीय कैफे में शाकाहारी लंच करें।",
              "location": "स्थानीय कैफे"
            },
            {
              "time": "02:30 PM",
              "activity": "मापुसा मार्केट (यदि शुक्रवार हो) या अंजुना फ्ली मार्केट (यदि बुधवार हो) का भ्रमण करें। स्थानीय हस्तशिल्प और स्मृति चिन्ह खरीदें।",
              "location": "मापुसा मार्केट/अंजुना फ्ली मार्केट"
            },
            {
              "time": "05:00 PM",
              "activity": "किसी शांत बीच शैक पर आराम करें और सूर्यास्त का आनंद लें।",
              "location": "वागेटर बीच/कैलंगुट बीच"
            },
            {
              "time": "07:30 PM",
              "activity": "एक विशेष शाकाहारी डिनर का आनंद लें।",
              "location": "उत्तरी गोवा रेस्टोरेंट"
            }
          ]
        },
        {
          "day": 7,
          "title": "Leisure & Departure",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "आराम से शाकाहारी नाश्ता करें।",
              "location": "होटल/गेस्टहाउस"
            },
            {
              "time": "10:30 AM",
              "activity": "होटल से चेक-आउट करें।",
              "location": "होटel/गेस्टहाउस"
            },
            {
              "time": "11:00 AM",
              "activity": "यदि समय हो तो कुछ अंतिम मिनट की खरीदारी करें या पास के बीच पर टहलें।",
              "location": "स्थानीय बाजार/बीच"
            },
            {
              "time": "12:30 PM",
              "activity": "हल्का शाकाहारी लंच करें।",
              "location": "स्थानीय कैफे"
            },
            {
              "time": "02:00 PM",
              "activity": "प्री-बुक किए गए टैक्सी/कैब से डबोलिम एयरपोर्ट (GOI) के लिए प्रस्थान करें।",
              "location": "डबोलिम एयरपोर्ट (GOI)"
            }
          ]
        }
      ],
      "foodItinerary": [
        {
          "meal": "Breakfast",
          "recommendation": "पोहा, उपमा, इडली-वड़ा, पूरी भाजी, फ्रूट प्लैटर, पैनकेक, टोस्ट और जैम, फ्रेश जूस।"
        },
        {
          "meal": "Lunch",
          "recommendation": "गोअन वेज थाली (सब्जी करी, चावल, रोटी), मशरूम मसाला, दाल फ्राई, राइस, वेज एक्सकुटी, फ्रेश सलाद।"
        },
        {
          "meal": "Dinner",
          "recommendation": "पनीर टिक्का, वेज बिरयानी, पास्ता, पिज्जा, कॉन्टिनेंटल वेज डिशेज, गोअन वेज करी।"
        },
        {
          "meal": "Snacks",
          "recommendation": "समोसा, वड़ा पाव, भजिया, फ्रेश नारियल पानी, फ्रूट जूस, गोअन स्वीट्स (बेबिंका, डोडोल), फ्राइड मोमोस।"
        }
      ],
      "famousPlaces": [
        "अंजुना बीच",
        "वागेटर बीच",
        "चपोरा फोर्ट",
        "बेसिलिका ऑफ बॉम जीसस (ओल्ड गोवा)",
        "से कैथेड्रल (ओल्ड गोवा)",
        "पालोलेम बीच",
        "अरामबोल स्वीट वाटर लेक",
        "मोरजिम बीच",
        "मापुसा मार्केट",
        "सहकारी स्पाइस प्लांटेशन"
      ],
      "dosAndDonts": {
        "dos": [
          "पर्याप्त पानी पीकर हाइड्रेटेड रहें।",
          "स्थानीय संस्कृति और रीति-रिवाजों का सम्मान करें।",
          "स्कूटर किराए पर लें (यदि आप सहज हों) स्थानीय परिवहन के लिए।",
          "स्थानीय शाकाहारी व्यंजनों का स्वाद लें।",
          "समुद्र तटों पर सूर्यास्त का आनंद लें।",
          "धूप से बचाव के लिए सनस्क्रीन और टोपी का प्रयोग करें।",
          "स्थानीय बाजारों में खरीदारी करते समय मोलभाव करें।"
        ],
        "donts": [
          "समुद्र तटों या सार्वजनिक स्थानों पर कूड़ा न फैलाएं।",
          "धार्मिक स्थलों पर अनुचित कपड़े न पहनें।",
          "शराब पीकर गाड़ी न चलाएं।",
          "असुरक्षित या भीड़भाड़ वाले क्षेत्रों में देर रात अकेले न घूमें।",
          "समुद्र में अकेले या खतरनाक लहरों के दौरान तैरने से बचें।",
          "अपने कीमती सामान को लावारिस न छोड़ें।",
          "स्थानीय लोगों के साथ अभद्र व्यवहार न करें।"
        ]
      }
    },
    "timestamp": 1763577264701
  },
  "{\"destination\":\"indore\",\"duration\":7,\"budget\":40000,\"persons\":4,\"objective\":\"leisure and sightseeing\",\"foodType\":\"veg\"}": {
    "data": {
      "destination": "Indore",
      "duration": 7,
      "itinerary": [
        {
          "day": 1,
          "title": "Arrival & Rajwada Heritage Walk",
          "activities": [
            {
              "time": "11:00 AM",
              "activity": "Arrive in Indore, check into your pre-booked hotel. Freshen up and relax after your journey.",
              "location": "Hotel (e.g., near Vijay Nagar or Railway Station for good connectivity)"
            },
            {
              "time": "01:00 PM",
              "activity": "Enjoy a traditional Malwa thali for lunch, offering a taste of local cuisine.",
              "location": "Local Restaurant (e.g., Shreemaya Celebrity or a popular thali place)"
            },
            {
              "time": "03:00 PM",
              "activity": "Explore the iconic Rajwada Palace, a magnificent seven-story historical palace showcasing a unique blend of Maratha, Mughal, and French architectural styles.",
              "location": "Rajwada Palace"
            },
            {
              "time": "04:30 PM",
              "activity": "Visit Kanch Mandir, a stunning Jain temple entirely adorned with intricate glass mosaics and mirror work, creating a dazzling effect.",
              "location": "Kanch Mandir"
            },
            {
              "time": "06:00 PM",
              "activity": "Stroll through the bustling streets around Rajwada, soaking in the vibrant local atmosphere and observing daily life.",
              "location": "Rajwada Market Area"
            },
            {
              "time": "08:00 PM",
              "activity": "Experience the world-famous Sarafa Bazaar, a jewelry market by day that transforms into a vibrant street food paradise by night. Indulge in a variety of local vegetarian delicacies.",
              "location": "Sarafa Bazaar"
            }
          ]
        },
        {
          "day": 2,
          "title": "Palaces, Chhatris & Cultural Insights",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Have breakfast at a local eatery, trying Indori Poha and Jalebi, a quintessential Indore breakfast.",
              "location": "Local Eatery (e.g., near your hotel or a popular spot like Chappan Dukan)"
            },
            {
              "time": "10:00 AM",
              "activity": "Visit the grand Lal Bagh Palace, a magnificent 19th-century palace that once served as the residence of the Holkar rulers, showcasing European architecture and royal artifacts.",
              "location": "Lal Bagh Palace"
            },
            {
              "time": "01:00 PM",
              "activity": "Lunch at a restaurant offering North Indian or South Indian vegetarian cuisine.",
              "location": "Restaurant in Palasia or MG Road area"
            },
            {
              "time": "03:00 PM",
              "activity": "Explore the Central Museum (Indore Museum), housing a rich collection of artifacts ranging from prehistoric tools to sculptures from the Gupta and Paramara periods.",
              "location": "Central Museum (Indore Museum)"
            },
            {
              "time": "04:30 PM",
              "activity": "Visit Krishnapura Chhatris, a serene complex of cenotaphs dedicated to the Holkar rulers, known for their architectural beauty and peaceful surroundings by the Khan River.",
              "location": "Krishnapura Chhatris"
            },
            {
              "time": "06:30 PM",
              "activity": "Enjoy a relaxing evening walk or some light shopping for textiles and local goods.",
              "location": "MT Cloth Market or nearby shopping areas"
            },
            {
              "time": "08:30 PM",
              "activity": "Dinner at a family-friendly vegetarian restaurant.",
              "location": "Restaurant of choice"
            }
          ]
        },
        {
          "day": 3,
          "title": "Spiritual Serenity & Nature's Embrace",
          "activities": [
            {
              "time": "08:30 AM",
              "activity": "Start your day with a visit to the famous Khajrana Ganesh Temple, one of the most revered temples in Indore, known for its large idol of Lord Ganesha.",
              "location": "Khajrana Ganesh Temple"
            },
            {
              "time": "09:30 AM",
              "activity": "Have breakfast near the temple, trying local snacks like Samosa or Kachori.",
              "location": "Eateries near Khajrana Temple"
            },
            {
              "time": "10:30 AM",
              "activity": "Visit the Annapurna Temple, dedicated to the goddess Annapurna, featuring intricate carvings and a peaceful ambiance, resembling the Meenakshi Temple of Madurai.",
              "location": "Annapurna Temple"
            },
            {
              "time": "01:00 PM",
              "activity": "Lunch at a pure vegetarian restaurant.",
              "location": "Local Veg Restaurant"
            },
            {
              "time": "02:30 PM",
              "activity": "Head to Ralamandal Wildlife Sanctuary for a refreshing nature walk and bird watching. It's a small, accessible sanctuary perfect for a couple of hours amidst greenery.",
              "location": "Ralamandal Wildlife Sanctuary"
            },
            {
              "time": "05:30 PM",
              "activity": "Relax at Pipliyapala Regional Park (ATAL Bihari Vajpayee Regional Park), enjoy the lush greenery, boating, and the musical fountain show (check timings and availability).",
              "location": "Pipliyapala Regional Park"
            },
            {
              "time": "08:00 PM",
              "activity": "Dinner at a restaurant offering a variety of vegetarian dishes, perhaps exploring a different cuisine.",
              "location": "Restaurant near your hotel or Vijay Nagar"
            }
          ]
        },
        {
          "day": 4,
          "title": "Indore's Foodie Paradise & Shopping Spree",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Experience breakfast at Chappan Dukan, a cluster of 56 food shops. Try Indori Poha, Jalebi, Bhutte ka Kees, and other local delights.",
              "location": "Chappan Dukan"
            },
            {
              "time": "11:00 AM",
              "activity": "Indulge in some souvenir shopping or explore local handicrafts and traditional items at Topkhana Market.",
              "location": "Topkhana Market"
            },
            {
              "time": "01:30 PM",
              "activity": "Lunch at a popular local restaurant, perhaps trying Dal Bafla or a traditional thali for a hearty meal.",
              "location": "Pishori Dhaba or similar local eatery"
            },
            {
              "time": "03:30 PM",
              "activity": "Continue your shopping spree at Sitlamata Bazaar for textiles, traditional wear, jewelry, and other local goods.",
              "location": "Sitlamata Bazaar"
            },
            {
              "time": "06:00 PM",
              "activity": "Enjoy evening snacks like Garadu (a local yam preparation) or Pani Puri from a street vendor.",
              "location": "Street food stalls around Chappan Dukan or Sarafa"
            },
            {
              "time": "07:30 PM",
              "activity": "Catch a movie at a local multiplex or enjoy a relaxed evening at a cafe with board games.",
              "location": "Local Multiplex/Cafe"
            },
            {
              "time": "09:00 PM",
              "activity": "Dinner at a restaurant known for its authentic Malwa cuisine or a multi-cuisine vegetarian spread.",
              "location": "Malwa Restaurant or a popular family restaurant"
            }
          ]
        },
        {
          "day": 5,
          "title": "Day Trip to Mandu - The City of Joy",
          "activities": [
            {
              "time": "08:00 AM",
              "activity": "Early breakfast at the hotel or a quick bite on the way to save time.",
              "location": "Hotel/Roadside Eatery"
            },
            {
              "time": "08:30 AM",
              "activity": "Depart for Mandu (approx. 2-2.5 hours drive). Hire a private taxi for a comfortable day trip.",
              "location": "Mandu"
            },
            {
              "time": "11:00 AM",
              "activity": "Explore the Royal Enclave: Jahaz Mahal (Ship Palace), Hindola Mahal (Swinging Palace), and the Champa Baoli.",
              "location": "Mandu Royal Enclave"
            },
            {
              "time": "01:00 PM",
              "activity": "Have lunch at a local restaurant in Mandu, enjoying simple yet delicious vegetarian fare.",
              "location": "Local Restaurant in Mandu"
            },
            {
              "time": "02:30 PM",
              "activity": "Visit Rani Roopmati's Pavilion and Baz Bahadur's Palace, offering panoramic views of the Narmada valley and the surrounding landscape.",
              "location": "Rani Roopmati's Pavilion & Baz Bahadur's Palace"
            },
            {
              "time": "04:00 PM",
              "activity": "Explore the Mandu Mosque Complex: Hoshang Shah's Tomb (India's first marble monument) and the grand Jami Masjid.",
              "location": "Mandu Mosque Complex"
            },
            {
              "time": "05:30 PM",
              "activity": "Begin your journey back to Indore, enjoying the scenic drive.",
              "location": "En route to Indore"
            },
            {
              "time": "08:00 PM",
              "activity": "Arrive back in Indore. Have a light dinner or snacks after a long day of exploration.",
              "location": "Hotel/Local Eatery in Indore"
            }
          ]
        },
        {
          "day": 6,
          "title": "Wildlife, Recreation & Farewell",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Enjoy a leisurely breakfast at your hotel or a nearby cafe, perhaps trying something new.",
              "location": "Hotel/Cafe"
            },
            {
              "time": "10:30 AM",
              "activity": "Visit Kamla Nehru Prani Sangrahalaya (Indore Zoo), home to a variety of animals, birds, and reptiles, including some rare species.",
              "location": "Indore Zoo"
            },
            {
              "time": "01:00 PM",
              "activity": "Lunch at a multi-cuisine vegetarian restaurant, perhaps in a mall for a modern dining experience.",
              "location": "Restaurant in a mall or popular area"
            },
            {
              "time": "03:00 PM",
              "activity": "Spend a relaxing afternoon at the Regional Park (Pipliyapala Regional Park) if you wish to revisit, or explore a local art gallery or bookshop.",
              "location": "Pipliyapala Regional Park / Local Art Gallery"
            },
            {
              "time": "05:00 PM",
              "activity": "Last-minute souvenir shopping or picking up some famous Indori namkeens (savory snacks) and sweets to take home.",
              "location": "Local Markets / Namkeen Shops (e.g., Agrawal Sweets & Namkeen)"
            },
            {
              "time": "07:30 PM",
              "activity": "Enjoy a special farewell dinner at a highly-rated vegetarian restaurant, savoring your favorite dishes.",
              "location": "High-rated Veg Restaurant (e.g., Nafees Restaurant - known for veg options, Mediterra)"
            },
            {
              "time": "09:00 PM",
              "activity": "Return to the hotel, pack your bags, and prepare for departure.",
              "location": "Hotel"
            }
          ]
        },
        {
          "day": 7,
          "title": "Departure from Indore",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Enjoy a final Indori breakfast, perhaps revisiting your favorite Poha or Jalebi spot.",
              "location": "Local Eatery"
            },
            {
              "time": "10:30 AM",
              "activity": "Depending on your flight/train schedule, you can do some last-minute shopping or revisit a favorite spot for a quick memory.",
              "location": "Local Market / Favorite Spot"
            },
            {
              "time": "12:00 PM",
              "activity": "Check out from the hotel.",
              "location": "Hotel"
            },
            {
              "time": "01:00 PM",
              "activity": "Head to the airport or railway station for your onward journey, carrying sweet memories of Indore.",
              "location": "Indore Airport/Railway Station"
            }
          ]
        }
      ],
      "foodItinerary": [
        {
          "meal": "Breakfast",
          "recommendation": "Indori Poha with Jalebi, Samosa, Kachori, Aloo Tikki, Idli, Dosa, Upma. Must-try at Chappan Dukan or local street vendors for authentic taste."
        },
        {
          "meal": "Lunch",
          "recommendation": "Traditional Malwa Thali (Dal Bafla, Kadhi, Sabzi, Roti), Dal Paniya, North Indian Thali, South Indian meals. Look for local restaurants like Shreemaya, Pishori Dhaba, or Rajhans."
        },
        {
          "meal": "Dinner",
          "recommendation": "Variety of vegetarian cuisines including North Indian, Punjabi, South Indian, and local Malwa dishes. Sarafa Bazaar for an unparalleled street food dinner experience. Restaurants like Nafees Restaurant (veg options), Mediterra, or The Square (Sayaji Hotel) for a fine dining experience."
        },
        {
          "meal": "Snacks",
          "recommendation": "Bhutte ka Kees (grated corn preparation), Garadu (fried yam), Pani Puri, Dahi Vada, Sabudana Khichdi, Kulfi, Shikanji (lemonade), various namkeens (savory snacks). Sarafa Bazaar and Chappan Dukan are prime spots for these delights."
        }
      ],
      "famousPlaces": [
        "Rajwada Palace",
        "Kanch Mandir",
        "Lal Bagh Palace",
        "Sarafa Bazaar",
        "Chappan Dukan",
        "Khajrana Ganesh Temple",
        "Annapurna Temple",
        "Central Museum (Indore Museum)",
        "Krishnapura Chhatris",
        "Pipliyapala Regional Park (ATAL Bihari Vajpayee Regional Park)"
      ],
      "dosAndDonts": {
        "dos": [
          "Do try the famous street food at Sarafa Bazaar and Chappan Dukan; it's a highlight of Indore.",
          "Do carry sufficient cash, especially for street food vendors and local markets, as card payments might not always be available.",
          "Do bargain politely when shopping in local markets; it's a common practice.",
          "Do respect local customs and traditions, especially when visiting temples and religious sites.",
          "Do stay hydrated, especially during warmer months, by drinking plenty of water and local beverages like Shikanji.",
          "Do use ride-sharing apps (Ola/Uber) or auto-rickshaws for convenient and affordable local transport.",
          "Do learn a few basic Hindi phrases like 'Namaste' (hello) and 'Dhanyawad' (thank you); it can enhance your interaction with locals."
        ],
        "donts": [
          "Don't litter; help keep the city clean by disposing of waste properly.",
          "Don't consume non-vegetarian food if you are strictly adhering to the 'veg' preference, as some places might have mixed menus (though many pure veg options are available).",
          "Don't venture into isolated areas late at night, especially if you are unfamiliar with the surroundings.",
          "Don't over-bargain aggressively; be respectful of vendors and their livelihoods.",
          "Don't forget to check the opening and closing times of attractions before visiting, as they can vary.",
          "Don't rely solely on card payments; many smaller shops and street vendors prefer or only accept cash.",
          "Don't forget to try the local namkeens and sweets as souvenirs."
        ]
      }
    },
    "timestamp": 1763578333385
  },
  "{\"destination\":\"indore\",\"duration\":2,\"budget\":10000,\"persons\":2,\"objective\":\"leisure and sightseeing\",\"foodType\":\"veg\"}": {
    "data": {
      "destination": "Indore",
      "duration": 2,
      "itinerary": [
        {
          "day": 1,
          "title": "Historical Marvels & Street Food Delights",
          "activities": [
            {
              "time": "08:00 AM",
              "activity": "Arrive in Indore, check into your budget-friendly hotel. Freshen up and get ready for the day.",
              "location": "Hotel in Indore (e.g., near Railway Station or Palasia area)"
            },
            {
              "time": "09:30 AM",
              "activity": "Enjoy a classic Indori breakfast of Poha and Jalebi at a local eatery, a must-try combination.",
              "location": "Local Eatery (e.g., Vijay Chaat House or any popular street vendor)"
            },
            {
              "time": "10:30 AM",
              "activity": "Explore the iconic Rajwada Palace, a magnificent seven-story historical palace blending Maratha, Mughal, and French architectural styles.",
              "location": "Rajwada Palace"
            },
            {
              "time": "12:00 PM",
              "activity": "Visit the exquisite Kanch Mandir (Glass Temple), a Jain temple entirely made of glass and mirrors, showcasing intricate artwork.",
              "location": "Kanch Mandir"
            },
            {
              "time": "01:30 PM",
              "activity": "Savor a delicious vegetarian lunch at a popular local restaurant, trying a traditional Thali or local specialties.",
              "location": "Local Restaurant (e.g., Shreemaya Celebrity, Guru Kripa)"
            },
            {
              "time": "03:00 PM",
              "activity": "Discover the grandeur of Lal Bagh Palace, a magnificent palace reflecting European architectural styles, set amidst beautiful gardens.",
              "location": "Lal Bagh Palace"
            },
            {
              "time": "05:30 PM",
              "activity": "Head to Chappan Dukan (56 Shops) for an evening of famous Indori street snacks like Bhutta ka Kees, Garadu, and Patties.",
              "location": "Chappan Dukan"
            },
            {
              "time": "07:30 PM",
              "activity": "Experience the vibrant night food market of Sarafa Bazaar for dinner and dessert, trying Dahi Vada, Aloo Tikki, Sabudana Khichdi, and Malpua.",
              "location": "Sarafa Bazaar"
            }
          ]
        },
        {
          "day": 2,
          "title": "Spiritual Serenity & Cultural Insights",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Start your day with a hearty breakfast, trying other local specialties like Samosa or Kachori.",
              "location": "Local Eatery"
            },
            {
              "time": "10:00 AM",
              "activity": "Visit the beautiful Annapurna Temple, dedicated to the goddess Annapurna, known for its unique architecture.",
              "location": "Annapurna Temple"
            },
            {
              "time": "11:30 AM",
              "activity": "Explore Gommatgiri, a serene Jain pilgrimage site featuring a 21-foot statue of Lord Bahubali and several small temples.",
              "location": "Gommatgiri"
            },
            {
              "time": "01:00 PM",
              "activity": "Enjoy a traditional vegetarian lunch, perhaps a Thali, at a local restaurant.",
              "location": "Local Restaurant"
            },
            {
              "time": "02:30 PM",
              "activity": "Delve into the history and culture of Madhya Pradesh at the Central Museum, housing a rich collection of artifacts.",
              "location": "Central Museum"
            },
            {
              "time": "04:30 PM",
              "activity": "Indulge in some souvenir shopping or explore local markets for Indori specialties like textiles, handicrafts, and famous namkeen.",
              "location": "Local Markets (e.g., MT Cloth Market area, Kothari Market)"
            },
            {
              "time": "06:00 PM",
              "activity": "Have an early light dinner or grab some famous Indori namkeen for your journey.",
              "location": "Local Eatery or Namkeen Shop"
            },
            {
              "time": "07:00 PM",
              "activity": "Depart from Indore with wonderful memories of its rich culture and delicious food.",
              "location": "Indore Railway Station/Airport"
            }
          ]
        }
      ],
      "foodItinerary": [
        {
          "meal": "Breakfast",
          "recommendation": "Indori Poha with Jalebi, Samosa, Kachori, Usal Poha. Try popular spots like Vijay Chaat House or local street vendors for authentic taste."
        },
        {
          "meal": "Lunch",
          "recommendation": "Traditional Vegetarian Thali, Dal Bafla, Sabzi-Roti. Restaurants like Shreemaya Celebrity, Guru Kripa, or local Bhojanalayas offer great options."
        },
        {
          "meal": "Dinner",
          "recommendation": "Street food at Sarafa Bazaar (Dahi Vada, Aando ka Halwa, Bhutte ka Kees, Garadu, Sabudana Khichdi, Malpua, Jalebi, Kulfi). For a sit-down meal, explore other veg restaurants."
        },
        {
          "meal": "Snacks",
          "recommendation": "Chappan Dukan specialties (Bhutta ka Kees, Garadu, Patties, Hot Dog, various sweets), Indori Namkeen (Ratlam Sev, Ujjaini Sev) from local shops."
        }
      ],
      "famousPlaces": [
        "Rajwada Palace",
        "Lal Bagh Palace",
        "Kanch Mandir",
        "Chappan Dukan",
        "Sarafa Bazaar",
        "Annapurna Temple",
        "Gommatgiri",
        "Central Museum",
        "Krishnapura Chhatris"
      ],
      "dosAndDonts": {
        "dos": [
          "Do try the diverse street food, especially at Chappan Dukan and Sarafa Bazaar; it's a highlight of Indore.",
          "Do carry sufficient cash for street food and local markets, though UPI is widely accepted.",
          "Do use ride-sharing apps (Ola/Uber) or auto-rickshaws for convenient and budget-friendly local transport.",
          "Do bargain politely when shopping in local markets for souvenirs and goods.",
          "Do respect local customs and traditions, especially when visiting religious sites; dress modestly.",
          "Do stay hydrated, especially during warmer months, by carrying a water bottle."
        ],
        "donts": [
          "Don't litter; help keep the city clean and beautiful.",
          "Don't visit Sarafa Bazaar too early; it truly comes alive after 8 PM and operates late into the night.",
          "Don't forget to check the opening and closing times of attractions before visiting to avoid disappointment.",
          "Don't hesitate to ask locals for directions or recommendations; they are generally helpful and friendly.",
          "Don't overspend on accommodation; budget hotels are plentiful and good for a short stay within your budget.",
          "Don't forget to try the famous Indori Namkeen and take some home as a souvenir."
        ]
      }
    },
    "timestamp": 1763578924469
  },
  "{\"destination\":\"guwahati\",\"duration\":2,\"budget\":65000,\"persons\":2,\"objective\":\"leisure and sightseeing\",\"foodType\":\"veg\"}": {
    "data": {
      "destination": "Guwahati",
      "duration": 2,
      "itinerary": [
        {
          "day": 1,
          "title": "Spiritual Serenity & Riverine Charm",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Arrive in Guwahati, check into your pre-booked hotel (e.g., Radisson Blu, Vivanta, Novotel for a comfortable stay within budget). Freshen up and relax.",
              "location": "Hotel in Guwahati"
            },
            {
              "time": "10:30 AM",
              "activity": "Visit the revered Kamakhya Temple, one of the oldest of the 51 Shakti Peethas. Opt for a VIP Darshan for a quicker and more comfortable experience.",
              "location": "Kamakhya Temple"
            },
            {
              "time": "01:30 PM",
              "activity": "Enjoy a delicious vegetarian lunch at a local restaurant near Kamakhya Temple or on the way back to the city center.",
              "location": "Local Veg Restaurant"
            },
            {
              "time": "03:00 PM",
              "activity": "Take a short ferry ride across the Brahmaputra River to Umananda Temple, located on Peacock Island. It's the smallest inhabited river island in the world.",
              "location": "Umananda Temple (Peacock Island)"
            },
            {
              "time": "05:30 PM",
              "activity": "Embark on a relaxing sunset cruise on the mighty Brahmaputra River. Enjoy the scenic views and the tranquil atmosphere.",
              "location": "Brahmaputra River Cruise (e.g., Alfresco Grand)"
            },
            {
              "time": "08:00 PM",
              "activity": "Savor a delightful vegetarian dinner at a well-regarded restaurant offering North Indian or multi-cuisine options.",
              "location": "Restaurant (e.g., The Dhaba, Kiranshree Portico)"
            },
            {
              "time": "09:30 PM",
              "activity": "Return to the hotel for a restful night.",
              "location": "Hotel in Guwahati"
            }
          ]
        },
        {
          "day": 2,
          "title": "Cultural Exploration & Local Flavors",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Enjoy a hearty vegetarian breakfast at your hotel.",
              "location": "Hotel in Guwahati"
            },
            {
              "time": "10:00 AM",
              "activity": "Explore the rich history and culture of Assam at the Assam State Museum, showcasing archaeological artifacts, sculptures, and tribal exhibits.",
              "location": "Assam State Museum"
            },
            {
              "time": "12:30 PM",
              "activity": "Indulge in a traditional Assamese vegetarian thali for lunch, experiencing local flavors.",
              "location": "Local Assamese Veg Restaurant"
            },
            {
              "time": "02:30 PM",
              "activity": "Visit Srimanta Sankaradeva Kalakshetra, a cultural institution showcasing the life and works of the great Vaishnava saint Srimanta Sankaradeva, along with Assamese art and culture.",
              "location": "Srimanta Sankaradeva Kalakshetra"
            },
            {
              "time": "05:00 PM",
              "activity": "Seek tranquility at Basistha Ashram, a serene ashram nestled amidst lush greenery, believed to be the abode of Sage Basistha.",
              "location": "Basistha Ashram"
            },
            {
              "time": "07:00 PM",
              "activity": "Explore Fancy Bazaar or Paltan Bazaar, popular local markets, for some souvenir shopping or to experience the local hustle and bustle.",
              "location": "Fancy Bazaar / Paltan Bazaar"
            },
            {
              "time": "08:30 PM",
              "activity": "Enjoy a farewell vegetarian dinner at a restaurant of your choice, perhaps trying a different cuisine or revisiting a favorite.",
              "location": "Restaurant (e.g., Paradise, JBs)"
            },
            {
              "time": "10:00 PM",
              "activity": "Return to the hotel, pack up, and prepare for departure.",
              "location": "Hotel in Guwahati"
            }
          ]
        }
      ],
      "foodItinerary": [
        {
          "meal": "Breakfast",
          "recommendation": "Hotel buffet (often includes Indian and continental options), Puri Sabzi, Aloo Paratha, Idli-Dosa at local eateries."
        },
        {
          "meal": "Lunch",
          "recommendation": "Assamese Veg Thali (dal, rice, pitika, sabzi, khar), North Indian Thali, South Indian meals, or Chinese vegetarian dishes."
        },
        {
          "meal": "Dinner",
          "recommendation": "Fine dining multi-cuisine vegetarian options, North Indian curries with various breads, or specialized South Indian restaurants."
        },
        {
          "meal": "Snacks",
          "recommendation": "Samosa, Kachori, Jalebi, Luchi-Sabzi, local sweets, fresh fruit juices."
        }
      ],
      "famousPlaces": [
        "Kamakhya Temple",
        "Umananda Temple (Peacock Island)",
        "Brahmaputra River Cruise",
        "Assam State Museum",
        "Srimanta Sankaradeva Kalakshetra",
        "Basistha Ashram",
        "Navagraha Temple",
        "Guwahati Zoo (Assam State Zoo cum Botanical Garden)",
        "Fancy Bazaar"
      ],
      "dosAndDonts": {
        "dos": [
          "Respect local customs and traditions, especially at religious sites.",
          "Dress modestly when visiting temples and other religious places.",
          "Try the local vegetarian cuisine, including the Assamese Thali.",
          "Stay hydrated, especially during warmer months.",
          "Bargain politely when shopping at local markets like Fancy Bazaar.",
          "Carry a valid ID proof at all times.",
          "Book private transport (cab) for convenience, given your generous budget."
        ],
        "donts": [
          "Litter or deface public places and historical monuments.",
          "Disrespect religious sentiments or practices.",
          "Consume alcohol openly in public areas.",
          "Trust unknown guides or touts; always opt for official or recommended services.",
          "Venture out alone late at night in unfamiliar or isolated areas.",
          "Take photos where explicitly prohibited, especially inside temples."
        ]
      }
    },
    "timestamp": 1763579388986
  },
  "{\"destination\":\"delhi\",\"duration\":2,\"budget\":10000,\"persons\":2,\"objective\":\"leisure and sightseeing\",\"foodType\":\"veg\"}": {
    "data": {
      "destination": "Delhi",
      "duration": 2,
      "itinerary": [
        {
          "day": 1,
          "title": "Old Delhi's Heritage & Central Delhi's Icons",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Arrive in Old Delhi. Start with a walk around Red Fort (exterior view only to save time and money) and Jama Masjid (exterior view, respect dress code).",
              "location": "Red Fort & Jama Masjid, Old Delhi"
            },
            {
              "time": "10:30 AM",
              "activity": "Explore Chandni Chowk. Indulge in a traditional Delhi breakfast/brunch (Parathas, Jalebi, Aloo Puri) at famous eateries.",
              "location": "Chandni Chowk"
            },
            {
              "time": "12:30 PM",
              "activity": "Continue exploring Chandni Chowk's various lanes for spices, textiles, and local goods. Try some street food snacks.",
              "location": "Chandni Chowk"
            },
            {
              "time": "02:00 PM",
              "activity": "Take a Metro to Central Delhi. Visit India Gate, a war memorial, and drive past Rashtrapati Bhavan (President's House) and Parliament House.",
              "location": "India Gate & Rajpath"
            },
            {
              "time": "04:30 PM",
              "activity": "Visit Agrasen ki Baoli, an ancient stepwell, offering a unique architectural experience and a peaceful escape.",
              "location": "Agrasen ki Baoli"
            },
            {
              "time": "06:30 PM",
              "activity": "Explore Connaught Place (CP), a bustling commercial hub. Enjoy some window shopping or relax at a cafe.",
              "location": "Connaught Place"
            },
            {
              "time": "08:00 PM",
              "activity": "Dinner at a budget-friendly restaurant in Connaught Place or nearby, serving North Indian vegetarian cuisine.",
              "location": "Connaught Place"
            }
          ]
        },
        {
          "day": 2,
          "title": "Mughal Marvels & Modern Culture",
          "activities": [
            {
              "time": "09:30 AM",
              "activity": "Visit Humayun's Tomb, a UNESCO World Heritage site and a precursor to the Taj Mahal. Allow ample time to explore the gardens. (Entry Fee: ₹40 per Indian adult)",
              "location": "Humayun's Tomb"
            },
            {
              "time": "11:30 AM",
              "activity": "Head to Qutub Minar, another UNESCO World Heritage site. Explore the complex including the Qutub Minar, Iron Pillar, and Alai Darwaza. (Entry Fee: ₹40 per Indian adult)",
              "location": "Qutub Minar Complex"
            },
            {
              "time": "01:30 PM",
              "activity": "Lunch at a local restaurant near Qutub Minar or in Saket/Malviya Nagar area, offering vegetarian thalis or popular dishes.",
              "location": "Saket/Malviya Nagar"
            },
            {
              "time": "03:30 PM",
              "activity": "Visit the Lotus Temple (Baháʼí House of Worship), known for its distinctive lotus-like architecture and serene gardens. (Exterior and gardens only, interior may have queues).",
              "location": "Lotus Temple"
            },
            {
              "time": "05:00 PM",
              "activity": "Experience Dilli Haat, an open-air market offering handicrafts, food, and cultural performances from various Indian states. Enjoy some regional snacks. (Entry Fee: ₹30 per person)",
              "location": "Dilli Haat (INA)"
            },
            {
              "time": "07:30 PM",
              "activity": "Dinner at one of the state food stalls in Dilli Haat for an authentic regional vegetarian meal, or a nearby restaurant.",
              "location": "Dilli Haat (INA)"
            },
            {
              "time": "09:00 PM",
              "activity": "Conclude your trip or head back to your accommodation.",
              "location": "Delhi"
            }
          ]
        }
      ],
      "foodItinerary": [
        {
          "meal": "Breakfast",
          "recommendation": "Start your day with authentic Delhi breakfast: Aloo Puri, Chole Bhature, or Parathas from Chandni Chowk. Don't miss Jalebi or Samosa."
        },
        {
          "meal": "Lunch",
          "recommendation": "Opt for a budget-friendly North Indian Thali, Rajma Chawal, or Kadhi Chawal at local eateries. Chole Bhature is also a great option."
        },
        {
          "meal": "Dinner",
          "recommendation": "Enjoy a full North Indian vegetarian meal with Paneer dishes, Dal Makhani, assorted breads. Dilli Haat offers diverse regional vegetarian options."
        },
        {
          "meal": "Snacks",
          "recommendation": "Indulge in Delhi's famous street food: Golgappe, Aloo Tikki, Dahi Bhalla, Kulfi, and various chaats. Look for popular and hygienic vendors."
        }
      ],
      "famousPlaces": [
        "Red Fort",
        "Jama Masjid",
        "Qutub Minar",
        "Humayun's Tomb",
        "India Gate",
        "Lotus Temple",
        "Chandni Chowk",
        "Agrasen ki Baoli",
        "Dilli Haat",
        "Connaught Place"
      ],
      "dosAndDonts": {
        "dos": [
          "Utilize the Delhi Metro for efficient and budget-friendly travel between major attractions.",
          "Bargain politely when shopping at local markets like Chandni Chowk or Dilli Haat.",
          "Stay hydrated, especially during warmer months, by carrying a water bottle.",
          "Try street food from popular and well-regarded vendors to ensure hygiene.",
          "Carry small denominations of cash (₹10, ₹20, ₹50) for street vendors and auto-rickshaws.",
          "Be aware of your surroundings and keep an eye on your belongings, especially in crowded areas.",
          "Learn a few basic Hindi phrases like 'Namaste' (hello) and 'Dhanyawad' (thank you)."
        ],
        "donts": [
          "Do not trust unsolicited guides or touts offering 'special' tours or deals.",
          "Avoid overpaying for auto-rickshaws; insist on using the meter or negotiate a fair price beforehand.",
          "Do not drink tap water; always opt for bottled water or filtered water.",
          "Avoid displaying expensive valuables openly, as it can attract unwanted attention.",
          "Do not litter; use designated dustbins to help keep the city clean.",
          "Avoid aggressive bargaining, maintain a respectful and friendly demeanor.",
          "Do not visit religious sites in inappropriate attire (e.g., short skirts/shorts, sleeveless tops); carry a scarf to cover up if needed."
        ]
      }
    },
    "timestamp": 1763579792711
  },
  "{\"destination\":\"ahmedabad\",\"duration\":3,\"budget\":20000,\"persons\":4,\"objective\":\"explore\",\"foodType\":\"veg\"}": {
    "data": {
      "destination": "Ahmedabad",
      "duration": 3,
      "itinerary": [
        {
          "day": 1,
          "title": "Heritage Walk & Gandhi's Legacy",
          "activities": [
            {
              "time": "08:00 AM",
              "activity": "Arrive in Ahmedabad, check into your budget-friendly hotel (e.g., near Kalupur Railway Station or Ashram Road for good connectivity). Freshen up.",
              "location": "Hotel in Ahmedabad"
            },
            {
              "time": "09:30 AM",
              "activity": "Embark on the Ahmedabad Heritage Walk (starts near Swaminarayan Temple, Kalupur). Explore the pols, ancient houses, and hidden temples of the Old City. Pre-booking recommended.",
              "location": "Swaminarayan Temple, Kalupur"
            },
            {
              "time": "01:00 PM",
              "activity": "Enjoy a traditional Gujarati Thali for lunch.",
              "location": "Local restaurant (e.g., Agashiye or Gordhan Thal for a premium experience, or a local thali joint for budget)"
            },
            {
              "time": "03:00 PM",
              "activity": "Visit the iconic Sidi Saiyyed Mosque, famous for its intricate stone lattice work (Jali).",
              "location": "Sidi Saiyyed Mosque"
            },
            {
              "time": "04:30 PM",
              "activity": "Explore Sabarmati Ashram, Mahatma Gandhi's former residence, and learn about his life and the Indian independence movement.",
              "location": "Sabarmati Ashram"
            },
            {
              "time": "06:30 PM",
              "activity": "Stroll along the Sabarmati Riverfront, enjoy the sunset views and the serene atmosphere.",
              "location": "Sabarmati Riverfront"
            },
            {
              "time": "08:30 PM",
              "activity": "Dinner at a local restaurant, trying some regional specialties.",
              "location": "Local restaurant near your hotel or Riverfront"
            }
          ]
        },
        {
          "day": 2,
          "title": "Architectural Marvels & Evening Delights",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Travel to Adalaj Stepwell, a stunning example of Indo-Islamic architecture and a functional water source.",
              "location": "Adalaj Stepwell"
            },
            {
              "time": "11:30 AM",
              "activity": "Visit the Hutheesing Jain Temple, a magnificent white marble temple dedicated to Dharmanatha, the 15th Jain Tirthankara.",
              "location": "Hutheesing Jain Temple"
            },
            {
              "time": "01:30 PM",
              "activity": "Lunch at a popular local eatery, perhaps trying a different type of thali or street food.",
              "location": "Local restaurant"
            },
            {
              "time": "03:30 PM",
              "activity": "Head to Kankaria Lake. Enjoy activities like the toy train, balloon safari (seasonal), or just relax by the lake.",
              "location": "Kankaria Lake"
            },
            {
              "time": "06:00 PM",
              "activity": "Explore the Sanskar Kendra Museum (designed by Le Corbusier) to learn about the city's history and culture.",
              "location": "Sanskar Kendra Museum"
            },
            {
              "time": "08:00 PM",
              "activity": "Experience the vibrant street food scene at Manek Chowk. It transforms into a bustling food market at night.",
              "location": "Manek Chowk"
            },
            {
              "time": "10:00 PM",
              "activity": "Return to hotel.",
              "location": "Hotel in Ahmedabad"
            }
          ]
        },
        {
          "day": 3,
          "title": "Art, Culture & Departure",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Visit the Auto World Vintage Car Museum (if interested in vintage cars) or the Gujarat Science City (if traveling with kids or interested in science).",
              "location": "Auto World Vintage Car Museum / Gujarat Science City"
            },
            {
              "time": "11:30 AM",
              "activity": "Explore the Shreyas Folk Museum, showcasing Gujarati folk art, textiles, and crafts.",
              "location": "Shreyas Folk Museum"
            },
            {
              "time": "01:30 PM",
              "activity": "Lunch at a restaurant offering a variety of vegetarian cuisines.",
              "location": "Local restaurant"
            },
            {
              "time": "03:00 PM",
              "activity": "Indulge in some souvenir shopping at Law Garden Night Market (starts setting up in the afternoon). Find traditional Gujarati handicrafts, textiles, and jewelry.",
              "location": "Law Garden Night Market"
            },
            {
              "time": "05:00 PM",
              "activity": "Enjoy a final cup of chai or coffee and some snacks.",
              "location": "Local cafe"
            },
            {
              "time": "06:00 PM",
              "activity": "Head to the railway station or airport for departure.",
              "location": "Ahmedabad Railway Station/Airport"
            }
          ]
        }
      ],
      "foodItinerary": [
        {
          "meal": "Breakfast",
          "recommendation": "Try local Gujarati breakfast items like Dhokla, Fafda-Jalebi, Khandvi, or Gathiya. Many local eateries and street vendors offer these."
        },
        {
          "meal": "Lunch",
          "recommendation": "A traditional Gujarati Thali is a must-try for lunch, offering a variety of sweet, sour, and spicy dishes. Look for local thali restaurants for an authentic experience."
        },
        {
          "meal": "Dinner",
          "recommendation": "Explore the vibrant street food scene at Manek Chowk for dinner, trying Dabeli, Pav Bhaji, Gola, and various chaats. Alternatively, enjoy a sit-down meal at a restaurant serving North Indian or South Indian vegetarian cuisine."
        },
        {
          "meal": "Snacks",
          "recommendation": "Indulge in local snacks like Sev Usal, Vada Pav, Locho, and various types of Bhajiyas. Don't forget to try some local sweets like Mohanthal or Basundi."
        }
      ],
      "famousPlaces": [
        "Sabarmati Ashram",
        "Sidi Saiyyed Mosque",
        "Adalaj Stepwell",
        "Hutheesing Jain Temple",
        "Kankaria Lake",
        "Manek Chowk (for street food)",
        "Ahmedabad Heritage Walk (Old City)",
        "Sabarmati Riverfront",
        "Law Garden (for shopping)",
        "Auto World Vintage Car Museum"
      ],
      "dosAndDonts": {
        "dos": [
          "Do try the local Gujarati Thali and street food at Manek Chowk.",
          "Do dress modestly, especially when visiting religious sites.",
          "Do carry sufficient water, especially during warmer months.",
          "Do bargain politely when shopping at local markets like Law Garden.",
          "Do use ride-sharing apps (Ola/Uber) or auto-rickshaws for convenient local transport.",
          "Do learn a few basic Hindi or Gujarati phrases (e.g., 'Namaste', 'Kem Chho' - How are you?).",
          "Do book the Ahmedabad Heritage Walk in advance."
        ],
        "donts": [
          "Don't expect non-vegetarian food easily; Ahmedabad is predominantly vegetarian.",
          "Don't litter; help keep the city clean.",
          "Don't disrespect religious customs or traditions.",
          "Don't venture into isolated areas late at night.",
          "Don't forget to remove your footwear before entering temples or mosques.",
          "Don't consume alcohol in public places, as Gujarat is a dry state (permit required for consumption)."
        ]
      }
    },
    "timestamp": 1763580718913
  },
  "{\"destination\":\"haridwar\",\"duration\":13,\"budget\":50000,\"persons\":5,\"objective\":\"devotion\",\"foodType\":\"veg\"}": {
    "data": {
      "destination": "Haridwar",
      "duration": 13,
      "itinerary": [
        {
          "day": 1,
          "title": "Arrival & Har Ki Pauri Immersion",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Arrive at Haridwar, transfer to pre-booked budget accommodation (Dharamshala/Ashram).",
              "location": "Haridwar Railway Station/Bus Stand"
            },
            {
              "time": "10:30 AM",
              "activity": "Check-in, freshen up and settle in.",
              "location": "Accommodation"
            },
            {
              "time": "12:00 PM",
              "activity": "Enjoy a simple vegetarian lunch at a local eatery.",
              "location": "Local Eatery"
            },
            {
              "time": "02:00 PM",
              "activity": "Take the first holy dip (Ganga Snan) in the sacred Ganges River.",
              "location": "Har Ki Pauri"
            },
            {
              "time": "03:30 PM",
              "activity": "Explore the various ghats around Har Ki Pauri, offer prayers and soak in the spiritual atmosphere.",
              "location": "Har Ki Pauri Ghats"
            },
            {
              "time": "05:00 PM",
              "activity": "Find a suitable spot to witness the evening Ganga Aarti.",
              "location": "Har Ki Pauri"
            },
            {
              "time": "06:00 PM",
              "activity": "Witness the mesmerizing Ganga Aarti, a grand spiritual ceremony.",
              "location": "Har Ki Pauri"
            },
            {
              "time": "07:30 PM",
              "activity": "Dinner at a nearby vegetarian restaurant.",
              "location": "Local Restaurant"
            }
          ]
        },
        {
          "day": 2,
          "title": "Mansa Devi & Local Market Exploration",
          "activities": [
            {
              "time": "07:00 AM",
              "activity": "Breakfast at the accommodation or a local tea stall.",
              "location": "Accommodation/Local Eatery"
            },
            {
              "time": "08:00 AM",
              "activity": "Head to Mansa Devi Temple. Take the ropeway (Udan Khatola) for panoramic views.",
              "location": "Mansa Devi Temple"
            },
            {
              "time": "09:30 AM",
              "activity": "Perform Darshan at Mansa Devi Temple, seeking blessings from the Goddess.",
              "location": "Mansa Devi Temple"
            },
            {
              "time": "11:00 AM",
              "activity": "Descend and explore Bara Bazaar, known for religious items, sweets, and local crafts.",
              "location": "Bara Bazaar"
            },
            {
              "time": "01:00 PM",
              "activity": "Lunch at a traditional local dhaba, trying regional specialties.",
              "location": "Local Dhaba"
            },
            {
              "time": "03:00 PM",
              "activity": "Visit Bilkeshwar Mahadev Temple, an ancient Shiva temple.",
              "location": "Bilkeshwar Mahadev Temple"
            },
            {
              "time": "05:00 PM",
              "activity": "Relax by the Ganga or revisit a peaceful ghat for quiet contemplation.",
              "location": "Ganga Ghats"
            },
            {
              "time": "07:30 PM",
              "activity": "Dinner.",
              "location": "Local Restaurant"
            }
          ]
        },
        {
          "day": 3,
          "title": "Chandi Devi & Maya Devi Temples",
          "activities": [
            {
              "time": "07:00 AM",
              "activity": "Breakfast.",
              "location": "Accommodation/Local Eatery"
            },
            {
              "time": "08:00 AM",
              "activity": "Head to Chandi Devi Temple. Take the ropeway for the ascent.",
              "location": "Chandi Devi Temple"
            },
            {
              "time": "09:30 AM",
              "activity": "Perform Darshan at Chandi Devi Temple, another Siddha Peeth.",
              "location": "Chandi Devi Temple"
            },
            {
              "time": "11:00 AM",
              "activity": "Descend and visit Maya Devi Temple, one of the oldest temples in Haridwar.",
              "location": "Maya Devi Temple"
            },
            {
              "time": "01:00 PM",
              "activity": "Lunch.",
              "location": "Local Eatery"
            },
            {
              "time": "03:00 PM",
              "activity": "Explore the local streets and markets near Maya Devi Temple.",
              "location": "Local Markets"
            },
            {
              "time": "05:00 PM",
              "activity": "Attend evening prayers or a small Aarti at a local temple like Pawan Dham.",
              "location": "Pawan Dham"
            },
            {
              "time": "07:30 PM",
              "activity": "Dinner.",
              "location": "Local Restaurant"
            }
          ]
        },
        {
          "day": 4,
          "title": "Daksha Mahadev & Kankhal Exploration",
          "activities": [
            {
              "time": "07:00 AM",
              "activity": "Breakfast.",
              "location": "Accommodation/Local Eatery"
            },
            {
              "time": "08:00 AM",
              "activity": "Travel to the Kankhal area of Haridwar (shared auto-rickshaw).",
              "location": "Kankhal"
            },
            {
              "time": "08:30 AM",
              "activity": "Visit Daksha Mahadev Temple and Sati Kund, significant mythological sites.",
              "location": "Daksha Mahadev Temple"
            },
            {
              "time": "10:30 AM",
              "activity": "Visit Anandamayi Ma Ashram in Kankhal, known for its spiritual ambiance.",
              "location": "Anandamayi Ma Ashram"
            },
            {
              "time": "12:00 PM",
              "activity": "Lunch in Kankhal, trying local vegetarian food.",
              "location": "Kankhal Local Eatery"
            },
            {
              "time": "02:00 PM",
              "activity": "Explore other ancient temples and ashrams in the Kankhal vicinity.",
              "location": "Kankhal"
            },
            {
              "time": "04:00 PM",
              "activity": "Return to the main Haridwar area.",
              "location": "Haridwar"
            },
            {
              "time": "07:30 PM",
              "activity": "Dinner.",
              "location": "Local Restaurant"
            }
          ]
        },
        {
          "day": 5,
          "title": "Bharat Mata Mandir & Shanti Kunj",
          "activities": [
            {
              "time": "07:00 AM",
              "activity": "Breakfast.",
              "location": "Accommodation/Local Eatery"
            },
            {
              "time": "08:00 AM",
              "activity": "Visit Bharat Mata Mandir, a unique temple dedicated to Mother India.",
              "location": "Bharat Mata Mandir"
            },
            {
              "time": "10:00 AM",
              "activity": "Visit Vaishno Devi Temple (replica), offering a similar experience to the original.",
              "location": "Vaishno Devi Temple (replica)"
            },
            {
              "time": "12:00 PM",
              "activity": "Lunch.",
              "location": "Local Eatery"
            },
            {
              "time": "02:00 PM",
              "activity": "Head to Shanti Kunj Gayatri Parivar, a renowned spiritual and social organization.",
              "location": "Shanti Kunj Gayatri Parivar"
            },
            {
              "time": "02:30 PM",
              "activity": "Participate in spiritual activities, explore the ashram grounds, and attend a discourse if available.",
              "location": "Shanti Kunj Gayatri Parivar"
            },
            {
              "time": "05:00 PM",
              "activity": "Return to accommodation.",
              "location": "Accommodation"
            },
            {
              "time": "07:30 PM",
              "activity": "Dinner.",
              "location": "Local Restaurant"
            }
          ]
        },
        {
          "day": 6,
          "title": "Rishikesh Day Trip",
          "activities": [
            {
              "time": "06:30 AM",
              "activity": "Early breakfast.",
              "location": "Accommodation/Local Eatery"
            },
            {
              "time": "07:00 AM",
              "activity": "Depart for Rishikesh by shared taxi or local bus (budget-friendly option).",
              "location": "Haridwar Bus Stand/Shared Taxi Stand"
            },
            {
              "time": "09:00 AM",
              "activity": "Arrive in Rishikesh, visit Ram Jhula and enjoy the views of the Ganges.",
              "location": "Ram Jhula, Rishikesh"
            },
            {
              "time": "10:30 AM",
              "activity": "Walk to Lakshman Jhula, explore surrounding temples like Trayambakeshwar Temple.",
              "location": "Lakshman Jhula, Rishikesh"
            },
            {
              "time": "01:00 PM",
              "activity": "Lunch at a riverside vegetarian cafe.",
              "location": "Rishikesh Riverside Cafe"
            },
            {
              "time": "02:30 PM",
              "activity": "Visit Parmarth Niketan Ashram, explore its beautiful grounds and statues.",
              "location": "Parmarth Niketan Ashram"
            },
            {
              "time": "04:00 PM",
              "activity": "Find a good spot to witness Parmarth Niketan's evening Ganga Aarti.",
              "location": "Parmarth Niketan Ashram"
            },
            {
              "time": "05:00 PM",
              "activity": "Witness the spiritual Ganga Aarti at Parmarth Niketan.",
              "location": "Parmarth Niketan Ashram"
            },
            {
              "time": "06:00 PM",
              "activity": "Depart for Haridwar.",
              "location": "Rishikesh Bus Stand/Shared Taxi Stand"
            },
            {
              "time": "08:00 PM",
              "activity": "Arrive in Haridwar, late dinner.",
              "location": "Haridwar"
            }
          ]
        },
        {
          "day": 7,
          "title": "Saptrishi Ashram & Bhimgoda Kund",
          "activities": [
            {
              "time": "08:00 AM",
              "activity": "Breakfast.",
              "location": "Accommodation/Local Eatery"
            },
            {
              "time": "09:00 AM",
              "activity": "Visit Saptrishi Ashram, where seven great sages are believed to have meditated.",
              "location": "Saptrishi Ashram"
            },
            {
              "time": "10:00 AM",
              "activity": "Explore Sapta Sarovar, the point where the Ganges splits into seven streams.",
              "location": "Sapta Sarovar"
            },
            {
              "time": "11:00 AM",
              "activity": "Visit Bhimgoda Kund, a sacred pond associated with Bhima from Mahabharata.",
              "location": "Bhimgoda Kund"
            },
            {
              "time": "12:30 PM",
              "activity": "Lunch.",
              "location": "Local Eatery"
            },
            {
              "time": "02:30 PM",
              "activity": "Visit Doodhadhari Barfani Temple, known for its white marble architecture.",
              "location": "Doodhadhari Barfani Temple"
            },
            {
              "time": "04:00 PM",
              "activity": "Explore other local temples or revisit a favorite ghat for quiet reflection.",
              "location": "Haridwar Temples/Ghats"
            },
            {
              "time": "07:30 PM",
              "activity": "Dinner.",
              "location": "Local Restaurant"
            }
          ]
        },
        {
          "day": 8,
          "title": "Local Temples & Ghats Exploration",
          "activities": [
            {
              "time": "08:00 AM",
              "activity": "Breakfast.",
              "location": "Accommodation/Local Eatery"
            },
            {
              "time": "09:00 AM",
              "activity": "Visit Bhuma Niketan Temple, known for its beautiful idols and spiritual ambiance.",
              "location": "Bhuma Niketan Temple"
            },
            {
              "time": "10:30 AM",
              "activity": "Explore different ghats along the Ganga (e.g., Vishnu Ghat, Gau Ghat) for varied perspectives.",
              "location": "Vishnu Ghat/Gau Ghat"
            },
            {
              "time": "12:30 PM",
              "activity": "Lunch.",
              "location": "Local Eatery"
            },
            {
              "time": "02:30 PM",
              "activity": "Visit Pawan Dham, a modern temple with beautiful glasswork.",
              "location": "Pawan Dham"
            },
            {
              "time": "04:00 PM",
              "activity": "Attend a spiritual discourse or satsang if available at a local ashram.",
              "location": "Local Ashram"
            },
            {
              "time": "07:30 PM",
              "activity": "Dinner.",
              "location": "Local Restaurant"
            }
          ]
        },
        {
          "day": 9,
          "title": "Spiritual Learning & Relaxation",
          "activities": [
            {
              "time": "08:00 AM",
              "activity": "Breakfast.",
              "location": "Accommodation/Local Eatery"
            },
            {
              "time": "09:00 AM",
              "activity": "Visit a local ashram (e.g., Prem Nagar Ashram if accessible) for morning prayers or meditation.",
              "location": "Local Ashram"
            },
            {
              "time": "12:00 PM",
              "activity": "Lunch.",
              "location": "Local Eatery"
            },
            {
              "time": "02:00 PM",
              "activity": "Free time for personal devotion, reading spiritual texts, or quiet contemplation by the Ganga.",
              "location": "Ganga Ghats/Accommodation"
            },
            {
              "time": "04:00 PM",
              "activity": "Explore local markets for specific religious items, books, or Prasad.",
              "location": "Local Markets"
            },
            {
              "time": "07:30 PM",
              "activity": "Dinner.",
              "location": "Local Restaurant"
            }
          ]
        },
        {
          "day": 10,
          "title": "Revisit & Local Delights",
          "activities": [
            {
              "time": "08:00 AM",
              "activity": "Breakfast.",
              "location": "Accommodation/Local Eatery"
            },
            {
              "time": "09:00 AM",
              "activity": "Revisit Har Ki Pauri for a peaceful morning Ganga Snan and prayers, experiencing it without the evening crowd.",
              "location": "Har Ki Pauri"
            },
            {
              "time": "11:00 AM",
              "activity": "Visit any local temples around Har Ki Pauri that might have been missed or for a deeper darshan.",
              "location": "Har Ki Pauri vicinity"
            },
            {
              "time": "01:00 PM",
              "activity": "Lunch.",
              "location": "Local Eatery"
            },
            {
              "time": "03:00 PM",
              "activity": "Explore the local food scene, trying different street food snacks like Samosa, Kachori, or Jalebi.",
              "location": "Local Street Food Stalls"
            },
            {
              "time": "05:00 PM",
              "activity": "Attend a less crowded evening aarti at a smaller ghat or temple for a more intimate experience.",
              "location": "Smaller Ghat/Temple"
            },
            {
              "time": "07:30 PM",
              "activity": "Dinner.",
              "location": "Local Restaurant"
            }
          ]
        },
        {
          "day": 11,
          "title": "Chandi Ghat & Reflection",
          "activities": [
            {
              "time": "08:00 AM",
              "activity": "Breakfast.",
              "location": "Accommodation/Local Eatery"
            },
            {
              "time": "09:00 AM",
              "activity": "Visit the Chandi Ghat area for a different view of the Ganga and surrounding nature, away from the main crowds.",
              "location": "Chandi Ghat"
            },
            {
              "time": "11:00 AM",
              "activity": "Spend time in meditation or quiet reflection at a peaceful spot by the river.",
              "location": "Ganga Riverside"
            },
            {
              "time": "01:00 PM",
              "activity": "Lunch.",
              "location": "Local Eatery"
            },
            {
              "time": "03:00 PM",
              "activity": "Last-minute souvenir shopping or revisiting a favorite market for specific items.",
              "location": "Local Markets"
            },
            {
              "time": "05:00 PM",
              "activity": "Enjoy a leisurely walk along the Ganga, observing local life and the serene environment.",
              "location": "Ganga Ghats"
            },
            {
              "time": "07:30 PM",
              "activity": "Dinner.",
              "location": "Local Restaurant"
            }
          ]
        },
        {
          "day": 12,
          "title": "Last Darshans & Farewell Aarti",
          "activities": [
            {
              "time": "07:00 AM",
              "activity": "Early morning Ganga Snan at Har Ki Pauri for a final spiritual dip.",
              "location": "Har Ki Pauri"
            },
            {
              "time": "08:30 AM",
              "activity": "Breakfast.",
              "location": "Accommodation/Local Eatery"
            },
            {
              "time": "09:30 AM",
              "activity": "Visit any significant temple for a final darshan or offer special prayers, expressing gratitude.",
              "location": "Chosen Temple"
            },
            {
              "time": "12:00 PM",
              "activity": "Lunch.",
              "location": "Local Eatery"
            },
            {
              "time": "02:00 PM",
              "activity": "Pack belongings and prepare for departure the next day.",
              "location": "Accommodation"
            },
            {
              "time": "05:00 PM",
              "activity": "Secure a good spot for the final grand Ganga Aarti at Har Ki Pauri.",
              "location": "Har Ki Pauri"
            },
            {
              "time": "06:00 PM",
              "activity": "Witness the magnificent Ganga Aarti one last time, soaking in its divine energy.",
              "location": "Har Ki Pauri"
            },
            {
              "time": "07:30 PM",
              "activity": "Farewell dinner, reflecting on the spiritual journey.",
              "location": "Local Restaurant"
            }
          ]
        },
        {
          "day": 13,
          "title": "Departure",
          "activities": [
            {
              "time": "08:00 AM",
              "activity": "Breakfast.",
              "location": "Accommodation/Local Eatery"
            },
            {
              "time": "09:00 AM",
              "activity": "Check-out from accommodation.",
              "location": "Accommodation"
            },
            {
              "time": "10:00 AM",
              "activity": "Depart from Haridwar with cherished memories and spiritual rejuvenation.",
              "location": "Haridwar Railway Station/Bus Stand"
            }
          ]
        }
      ],
      "foodItinerary": [
        {
          "meal": "Breakfast",
          "recommendation": "Aloo Puri, Jalebi, Poha, Parathas with pickle/curd, Bread Pakora, Samosa, Tea/Coffee."
        },
        {
          "meal": "Lunch",
          "recommendation": "Simple Thali (Dal, Roti, Sabzi, Rice), Chole Bhature, Rajma Chawal, Kadhi Chawal, Puri Sabzi."
        },
        {
          "meal": "Dinner",
          "recommendation": "Thali meals, Paneer dishes, Mixed Vegetable curries, Dal Makhani, Roti/Naan, Rice. Keep it light and fresh."
        },
        {
          "meal": "Snacks",
          "recommendation": "Samosa, Kachori, Lassi, Fresh Fruit Juice, Sweets (Pedha, Barfi, Gulab Jamun), Pakoras."
        }
      ],
      "famousPlaces": [
        "Har Ki Pauri",
        "Mansa Devi Temple",
        "Chandi Devi Temple",
        "Maya Devi Temple",
        "Daksha Mahadev Temple",
        "Bharat Mata Mandir",
        "Shanti Kunj Gayatri Parivar",
        "Saptrishi Ashram",
        "Pawan Dham",
        "Vaishno Devi Temple (replica)"
      ],
      "dosAndDonts": {
        "dos": [
          "Dress modestly, especially when visiting temples and ashrams.",
          "Respect local customs and traditions; greet with 'Jai Ganga Maiya' or 'Har Har Mahadev'.",
          "Keep the surroundings clean; use dustbins and avoid littering.",
          "Bargain politely when shopping in local markets.",
          "Stay hydrated by drinking plenty of water, especially during warmer months.",
          "Learn a few basic Hindi phrases (e.g., 'Namaste', 'Dhanyawad', 'Kitne ka hai?').",
          "Carry a small bag for offerings and personal items, and keep valuables secure."
        ],
        "donts": [
          "Do not consume non-vegetarian food or alcohol in Haridwar, as it is a holy city.",
          "Do not disrespect religious sites or rituals; maintain silence and reverence.",
          "Avoid swimming in unsafe or restricted areas of the Ganges.",
          "Do not fall for touts or unauthorized guides; always verify credentials.",
          "Avoid public displays of affection, as it is considered inappropriate.",
          "Do not photograph without permission, especially inside temples or of individuals.",
          "Avoid littering or polluting the Ganges River."
        ]
      }
    },
    "timestamp": 1763581039623
  },
  "{\"destination\":\"chennai\",\"duration\":2,\"budget\":20000,\"persons\":2,\"objective\":\"leisure and sightseeing\",\"foodType\":\"veg\"}": {
    "data": {
      "destination": "Chennai",
      "duration": 2,
      "itinerary": [
        {
          "day": 1,
          "title": "Heritage, Culture & Coastal Charm",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Arrive in Chennai, check into your hotel. Freshen up and have a light South Indian breakfast at a local eatery near your hotel.",
              "location": "Hotel (e.g., Mylapore/Egmore area for central access)"
            },
            {
              "time": "10:30 AM",
              "activity": "Visit the iconic Kapaleeshwarar Temple, a magnificent Dravidian-style temple dedicated to Lord Shiva. Explore its intricate gopuram and vibrant sculptures.",
              "location": "Kapaleeshwarar Temple, Mylapore"
            },
            {
              "time": "12:00 PM",
              "activity": "Explore Santhome Basilica, a beautiful Roman Catholic minor basilica built over the tomb of St. Thomas the Apostle, located close to Kapaleeshwarar Temple.",
              "location": "Santhome Basilica, Mylapore"
            },
            {
              "time": "01:30 PM",
              "activity": "Enjoy a traditional South Indian vegetarian lunch, perhaps a 'Thali' (meals) at a popular local restaurant.",
              "location": "Local restaurant in Mylapore (e.g., Saravana Bhavan, Karpagambal Mess)"
            },
            {
              "time": "03:00 PM",
              "activity": "Discover Fort St. George, the first English fortress in India. Visit St. Mary's Church (the oldest Anglican church in India) and the Fort Museum.",
              "location": "Fort St. George"
            },
            {
              "time": "05:00 PM",
              "activity": "Relax and enjoy the sunset at Marina Beach, one of the longest urban beaches in the world. Take a leisurely stroll and soak in the vibrant atmosphere.",
              "location": "Marina Beach"
            },
            {
              "time": "08:00 PM",
              "activity": "Have dinner at a well-regarded vegetarian restaurant, trying some local specialties or a multi-cuisine veg meal.",
              "location": "Restaurant in Nungambakkam or T. Nagar (e.g., A2B Adyar Ananda Bhavan, Murugan Idli Shop)"
            }
          ]
        },
        {
          "day": 2,
          "title": "Spiritual Serenity, History & Shopping Delights",
          "activities": [
            {
              "time": "09:00 AM",
              "activity": "Start your day with a visit to the Vadapalani Murugan Temple, a popular Hindu temple dedicated to Lord Muruga, known for its vibrant architecture.",
              "location": "Vadapalani Murugan Temple"
            },
            {
              "time": "10:30 AM",
              "activity": "Explore the Government Museum (Egmore Museum), one of India's oldest museums, housing a rich collection of art, archaeology, and natural history.",
              "location": "Government Museum, Egmore"
            },
            {
              "time": "01:00 PM",
              "activity": "Savor a delicious vegetarian lunch, perhaps trying a different regional South Indian cuisine or a North Indian thali.",
              "location": "Restaurant near Egmore/T. Nagar (e.g., Sangeetha Veg Restaurant)"
            },
            {
              "time": "02:30 PM",
              "activity": "Indulge in some shopping at T. Nagar, Chennai's bustling commercial hub, known for its sarees, jewelry, traditional clothing, and handicrafts.",
              "location": "T. Nagar (Pondy Bazaar / Ranganathan Street)"
            },
            {
              "time": "05:00 PM",
              "activity": "Enjoy a relaxed evening at Besant Nagar Beach (Elliot's Beach), known for its calmer atmosphere, promenade, and cafes. Grab a filter coffee or a snack.",
              "location": "Besant Nagar Beach"
            },
            {
              "time": "07:00 PM",
              "activity": "Have your farewell dinner, trying some local delicacies or a multi-cuisine vegetarian meal at a comfortable restaurant.",
              "location": "Restaurant in Besant Nagar or Adyar (e.g., Cream Centre, Eden)"
            },
            {
              "time": "09:00 PM",
              "activity": "Head back to the hotel to collect your luggage or proceed directly to the airport/station for departure.",
              "location": "Chennai"
            }
          ]
        }
      ],
      "foodItinerary": [
        {
          "meal": "Breakfast",
          "recommendation": "Traditional South Indian breakfast is a must: Idli, Dosa (Masala Dosa, Ghee Roast), Vada, Pongal, Upma, served with fresh Sambar and various Chutneys. Conclude with an authentic Filter Coffee."
        },
        {
          "meal": "Lunch",
          "recommendation": "Opt for a South Indian Thali (Meals): A wholesome platter with rice, Sambar, Rasam, Kootu (lentil and vegetable stew), Poriyal (stir-fried vegetables), Appalam (papad), curd, and a sweet dish. Also try Lemon Rice or Curd Rice for lighter options."
        },
        {
          "meal": "Dinner",
          "recommendation": "Explore a variety of Dosa (e.g., Onion Rava Dosa, Paneer Dosa), Uthappam, or opt for North Indian vegetarian dishes like Paneer Butter Masala, Dal Makhani with Naan/Roti. Veg Biryani is also a popular and delicious choice."
        },
        {
          "meal": "Snacks",
          "recommendation": "Enjoy hot Bajji (fritters made with various vegetables like onion, potato, banana), Sundal (chickpea salad), Murukku, and of course, more Filter Coffee or refreshing fresh fruit juices."
        }
      ],
      "famousPlaces": [
        "Marina Beach",
        "Kapaleeshwarar Temple",
        "Santhome Basilica",
        "Fort St. George",
        "Government Museum (Egmore Museum)",
        "Besant Nagar Beach (Elliot's Beach)",
        "Vadapalani Murugan Temple",
        "Vivekananda House (Ice House)",
        "T. Nagar (for shopping)"
      ],
      "dosAndDonts": {
        "dos": [
          "Dress modestly, especially when visiting temples and religious sites. Shoulders and knees should be covered.",
          "Stay hydrated by drinking plenty of bottled water and fresh juices, especially during hot months.",
          "Bargain politely when shopping in local markets like T. Nagar; it's part of the culture.",
          "Try local vegetarian cuisine at authentic restaurants; Chennai offers a fantastic culinary experience.",
          "Use ride-sharing apps (Ola/Uber) or pre-paid taxis for convenient and fair-priced transportation.",
          "Learn a few basic Tamil phrases like 'Vannakkam' (hello) or 'Nandri' (thank you) – locals appreciate the effort.",
          "Carry a power bank for your phone as you'll be using maps and taking photos throughout the day."
        ],
        "donts": [
          "Don't litter; help keep the city clean by disposing of waste properly.",
          "Avoid drinking tap water; stick to bottled water or filtered water provided by your hotel.",
          "Don't engage in public displays of affection, as it might be frowned upon in conservative areas.",
          "Don't disrespect local customs or religious practices, especially inside temples.",
          "Avoid venturing into unfamiliar areas alone late at night, especially if you are new to the city.",
          "Don't forget to remove your footwear before entering temples, mosques, and sometimes even smaller shops or homes."
        ]
      }
    },
    "timestamp": 1763581196003
  }
}